src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКомментариев</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебнаяЗаметка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗакреплениеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакреплениеОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСостоянийОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РемонтОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РемонтОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСостоянийОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРемонта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРемонта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРемонта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРемонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПослеРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ITЗаявка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура НастроитьДоступностьФормыПоРолям()
	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");
	ЭтоСотрудник = РольДоступна("ПользовательСотрудник"); 
	ЭтоРуководитель = РольДоступна("РуководительITОтдела");
	ЭтоИсполнитель = РольДоступна("ИсполнительЗаявок");
	ЭтоОтветственныйЗаОборудование = РольДоступна("ОтветственныйЗаОборудование");
	ЭтоНоваяЗаявка = Не ЗначениеЗаполнено(Объект.Ссылка);
	КатегорияТребуетОборудование = Ложь;

	Если ЗначениеЗаполнено(Объект.Категория) Тогда
		КатегорияТребуетОборудование = Объект.Категория.ТребуетОборудование;
	КонецЕсли;
	
	Элементы.ВыдатьОборудование.Видимость = (ЭтоАдминистратор ИЛИ ЭтоОтветственныйЗаОборудование) И НЕ ЭтоНоваяЗаявка И Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование;
	Элементы.ПередатьВРемонт.Видимость = (ЭтоАдминистратор ИЛИ ЭтоОтветственныйЗаОборудование) И НЕ ЭтоНоваяЗаявка И ЗначениеЗаполнено(Объект.Оборудование) И Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование;
	
	Элементы.Номер.Доступность = Ложь;
	Элементы.Дата.Доступность = Ложь;
	Элементы.Заявитель.Доступность = Ложь;
	Элементы.Категория.Доступность = Ложь;
	Элементы.Приоритет.Доступность = Ложь;
	Элементы.ОписаниеПроблемы.Доступность = Истина;
	Элементы.ОписаниеПроблемы.ТолькоПросмотр = Истина;
	Элементы.Оборудование.Доступность = Ложь;
	Элементы.Исполнитель.Доступность = Ложь;
	Элементы.ТекущийСтатус.Доступность = Ложь;     
	Элементы.СрокРеакции.Доступность = Ложь;
	Элементы.СрокРешения.Доступность = Ложь;
	Элементы.ДатаРеакции.Доступность = Ложь;
	Элементы.ДатаРешения.Доступность = Ложь;
	Элементы.ДатаЗакрытия.Доступность = Ложь;
    Элементы.РезультатВыполнения.Доступность = Ложь; 
	
	Если ЭтоАдминистратор Тогда
		Элементы.Категория.Доступность = Истина;
		Элементы.Приоритет.Доступность = Истина;
		Элементы.ОписаниеПроблемы.Доступность = Истина;
		Элементы.ОписаниеПроблемы.ТолькоПросмотр = Ложь;
		Элементы.Оборудование.Доступность = Истина;
		Элементы.Исполнитель.Доступность = Истина;
		Элементы.ТекущийСтатус.Доступность = Истина;
		Элементы.РезультатВыполнения.Доступность = Истина;
		Возврат;
	КонецЕсли;
	 	
    Если ЭтоСотрудник И ЭтоНоваяЗаявка Тогда
		Элементы.Категория.Доступность = Истина;
        Элементы.Приоритет.Доступность = Истина;
		Элементы.ОписаниеПроблемы.ТолькоПросмотр = Ложь;
		Элементы.Оборудование.Доступность = КатегорияТребуетОборудование;
	КонецЕсли; 
	
	Если ЭтоРуководитель Тогда
		Элементы.ТекущийСтатус.Доступность = Истина;

		Если Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.Новая
			ИЛИ Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.Назначена Тогда

			Элементы.Категория.Доступность = Истина;
			Элементы.Приоритет.Доступность = Истина;
			Элементы.Оборудование.Доступность = Истина;
			Элементы.Исполнитель.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоИсполнитель Тогда
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();	

		Если ТекущийСотрудник <> Неопределено И Объект.Исполнитель = ТекущийСотрудник Тогда
			Если Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.Назначена
			ИЛИ Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе 
			ИЛИ Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения
			ИЛИ Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда
            	Элементы.ТекущийСтатус.Доступность = Истина;
			КонецЕсли;
			
			Если Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
				Элементы.РезультатВыполнения.Доступность = Истина;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли; 
	
	Если ЭтоОтветственныйЗаОборудование И НЕ ЭтоНоваяЗаявка И Объект.ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда	
		Элементы.ТекущийСтатус.Доступность = Истина;
		Элементы.ТекущийСтатус.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ДобавитьУсловиеОтбораКомментариев(КоллекцияЭлементов, ИмяПоля, ВидСравнения, Значение)

	ЭлементОтбора =
		КоллекцияЭлементов.Добавить(
			Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения = ВидСравнения;
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьОтборКомментариев()

	Отбор =
		СписокКомментариев.КомпоновщикНастроек
			.ФиксированныеНастройки.Отбор;

	Отбор.Элементы.Очистить();

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Комментарии.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");
	ЭтоРуководитель = РольДоступна("РуководительITОтдела");
	ЭтоСотрудник = РольДоступна("ПользовательСотрудник");
	ЭтоИсполнитель = РольДоступна("ИсполнительЗаявок");

	ТекущийСотрудник = Неопределено;

	Если НЕ ЭтоАдминистратор И НЕ ЭтоРуководитель Тогда
		Попытка
			ТекущийСотрудник =
				УправлениеПользователямиСервер
					.ПолучитьТекущегоСотрудника();
		Исключение
			Элементы.Комментарии.Видимость = Ложь;
			Возврат;
		КонецПопытки;
	КонецЕсли;

	ЭтоЗаявитель =
		ЭтоСотрудник
		И ТекущийСотрудник <> Неопределено
		И ТекущийСотрудник = Объект.Заявитель;

	ЭтоНазначенныйИсполнитель =
		ЭтоИсполнитель
		И ТекущийСотрудник <> Неопределено
		И ТекущийСотрудник = Объект.Исполнитель;

	МожноПросматриватьКомментарии =
		ЭтоАдминистратор
		ИЛИ ЭтоРуководитель
		ИЛИ ЭтоЗаявитель
		ИЛИ ЭтоНазначенныйИсполнитель;

	Элементы.Комментарии.Видимость = МожноПросматриватьКомментарии;

	Если НЕ МожноПросматриватьКомментарии Тогда
		Возврат;
	КонецЕсли;

	ДобавитьУсловиеОтбораКомментариев(Отбор.Элементы, "Заявка", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка);
	
	ДобавитьУсловиеОтбораКомментариев(Отбор.Элементы, "Аннулирован", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	МожноВидетьСлужебныеЗаметки =
		ЭтоАдминистратор
		ИЛИ ЭтоРуководитель
		ИЛИ ЭтоНазначенныйИсполнитель;

	Если НЕ МожноВидетьСлужебныеЗаметки Тогда
		ДобавитьУсловиеОтбораКомментариев(Отбор.Элементы, "ТипКомментария", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.ТипыКомментариев.СлужебнаяЗаметка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьДоступностьФормыПоРолям();
	НастроитьОтборКомментариев();
	НастроитьВыборОборудования();
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НастроитьДоступностьФормыПоРолям();  
	НастроитьОтборКомментариев();    
КонецПроцедуры         

&НаСервере
Функция ЗаписатьКомментарийНаСервере()  
	
	КомментарийЗаписан =
		УправлениеКомментариямиСервер.ЗаписатьКомментарий(
			Объект.Ссылка,
			ТипНовогоКомментария,
			ТекстНовогоКомментария);

	Если КомментарийЗаписан Тогда
		ТипНовогоКомментария =
			Перечисления.ТипыКомментариев.ПустаяСсылка();

		ТекстНовогоКомментария = "";
	КонецЕсли;

	Возврат КомментарийЗаписан;
КонецФункции   

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)

	Если НЕ ЗначениеЗаполнено(ТипНовогоКомментария) Тогда
		Сообщить("Выберите тип комментария.");
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ТекстНовогоКомментария)) Тогда
		Сообщить("Введите текст комментария.");
		Возврат;
	КонецЕсли;

	КомментарийЗаписан = ЗаписатьКомментарийНаСервере();

	Если НЕ КомментарийЗаписан Тогда
		Возврат;
	КонецЕсли;

	Элементы.СписокКомментариев.Обновить();

КонецПроцедуры

&НаСервере
Функция АннулироватьКомментарийНаСервере(Период, Автор, ТипКомментария)

	Возврат УправлениеКомментариямиСервер.АннулироватьКомментарий(Период, Объект.Ссылка, Автор, ТипКомментария);

КонецФункции 

&НаКлиенте
Процедура АннулироватьКомментарий(Команда)

	ТекущаяСтрока = Элементы.СписокКомментариев.ТекущиеДанные;

	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Выберите комментарий.");
		Возврат;
	КонецЕсли;

	КомментарийАннулирован = 
		АннулироватьКомментарийНаСервере(
			ТекущаяСтрока.Период,
			ТекущаяСтрока.Автор,
			ТекущаяСтрока.ТипКомментария);

	Если НЕ КомментарийАннулирован Тогда
		Возврат;
	КонецЕсли;

	Элементы.СписокКомментариев.Обновить();

КонецПроцедуры

&НаСервере
Функция ОтметитьУведомленияЗаявкиПрочитаннымиНаСервере()

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат УправлениеУведомлениямиСервер.ОтметитьУведомленияПоЗаявкеПрочитанными(Объект.Ссылка);

КонецФункции  

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УведомленияПрочитаны = ОтметитьУведомленияЗаявкиПрочитаннымиНаСервере();
    НастроитьДоступныеТипыКомментариев();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьОборудование(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала запишите заявку.");
		Возврат;
	КонецЕсли;

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Заявка", Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("Сотрудник", Объект.Заявитель);

	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ЗакреплениеОборудования.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьВРемонт(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала запишите заявку.");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.Оборудование) Тогда
		Сообщить("В заявке не указано проблемное оборудование.");
		Возврат;
	КонецЕсли;

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Заявка", Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("Оборудование", Объект.Оборудование);

	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.РемонтОборудования.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеТипыКомментариевНаСервере()

	Возврат УправлениеКомментариямиСервер.ПолучитьДоступныеТипыКомментариев(Объект.Ссылка);

КонецФункции

&НаКлиенте
Процедура НастроитьДоступныеТипыКомментариев()

	ДоступныеТипы = ПолучитьДоступныеТипыКомментариевНаСервере(); 
	СписокВыбора = Элементы.ТипНовогоКомментария.СписокВыбора;
	СписокВыбора.Очистить();

	Для Каждого ДоступныйТип Из ДоступныеТипы Цикл
		СписокВыбора.Добавить(ДоступныйТип.Значение,ДоступныйТип.Представление);
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НастроитьДоступныеТипыКомментариев();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	НастроитьДоступностьФормыПоРолям();
КонецПроцедуры

&НаСервере
Процедура НастроитьВыборОборудования()

	ПараметрыВыбораОборудования = Новый Массив;

	ПараметрыВыбораОборудования.Добавить(Новый ПараметрВыбора("Отбор.ТекущееСостояние", Перечисления.СостоянияОборудования.Используется));

	ПараметрыВыбораОборудования.Добавить(Новый ПараметрВыбора("Отбор.ОтветственныйСотрудник", Объект.Заявитель));

	Элементы.Оборудование.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОборудования);

КонецПроцедуры
